# 1)Работа со списками
# Дан список. Выведите на экран первый и последний элементы.
lst = ['🍇', '🍑', '🍐', '🍊', '🍌', '🍎']
print(lst[0], lst[-1])
